Gregification/BeeMS/CAN_ETH_TRX_MSPM0G/src/Core/system.cpp
/*
 * system.cpp
 *
 *  Created on: Jun 6, 2025
 *      Author: FSAE
 */

#include "system.hpp"

#include <FreeRTOS.h>
#include <task.h>
#include <ti/driverlib/driverlib.h>

/*--- variables ------------------------------------------------------------------------*/

namespace System {
    uint16_t mcuID = 0;

    #ifdef PROJECT_ENABLE_UART0
        UART::UART UART::uart0 = {.reg = UART0};
    #endif

    #ifdef PROJECT_ENABLE_UART2
        UART::UART UART::uart2 = {.reg = UART2};
    #endif

    #ifdef PROJECT_ENABLE_SPI0
        SPI::SPI SPI::spi0 = {.reg = SPI0, .irq_type = IRQn_Type::SPI0_INT_IRQn, .TRANSFER_FILLER_BYTE = 0};
    #endif
    #ifdef PROJECT_ENABLE_SPI1
        SPI::SPI SPI::spi1 = {.reg = SPI1, .irq_type = IRQn_Type::SPI1_INT_IRQn, .TRANSFER_FILLER_BYTE = 0};
    #endif
    #ifdef PROJECT_ENABLE_I2C1
        I2C::I2C I2C::i2c1 = {.reg = I2C1};
    #endif

    #ifdef PROJECT_ENABLE_MCAN0
        CANFD::CANFD CANFD::canFD0 = {.reg = CANFD0};
    #endif
}

void System::init() {
    mcuID = DL_FactoryRegion_getTraceID();

    DL_GPIO_disablePower(GPIOA);
    DL_GPIO_disablePower(GPIOB);
    DL_GPIO_reset(GPIOA);
    DL_GPIO_reset(GPIOB);
    DL_GPIO_enablePower(GPIOA);
    DL_GPIO_enablePower(GPIOB);
    delay_cycles(POWER_STARTUP_DELAY);

    #ifdef PROJECT_ENABLE_MCAN0
        // MCAN has to be enabled before the clocks are modified or the ram wont initialize

        // pins for v: 2.2, 3.0
        DL_GPIO_initPeripheralOutputFunction(IOMUX_PINCM59, IOMUX_PINCM59_PF_CANFD0_CANTX); // CANTX, PA26
        DL_GPIO_initPeripheralInputFunction(IOMUX_PINCM60, IOMUX_PINCM60_PF_CANFD0_CANRX); // CANRX, PA27

        DL_MCAN_enablePower(CANFD0);
        delay_cycles(POWER_STARTUP_DELAY);
    #endif

    /*
     * BOR typical trigger level (v) (DS.7.6.1)
     *  0: 1.57
     *  1: 2.14
     *  2: 2.73
     *  3: 2.92
     */
    DL_SYSCTL_setBORThreshold(DL_SYSCTL_BOR_THRESHOLD_LEVEL::DL_SYSCTL_BOR_THRESHOLD_LEVEL_2);

    DL_SYSCTL_setFlashWaitState(DL_SYSCTL_FLASH_WAIT_STATE_2);

    // clock configuration
    {
        DL_SYSCTL_setSYSOSCFreq(DL_SYSCTL_SYSOSC_FREQ::DL_SYSCTL_SYSOSC_FREQ_BASE); // SYSOSC 32Mhz

        DL_SYSCTL_disableHFXT();
        DL_SYSCTL_disableSYSPLL();

        //target 160Mhz VCO
        constexpr DL_SYSCTL_SYSPLLConfig pll_config = {
                .rDivClk2x  = 0x0,
                .rDivClk1   = 0x0,
                .rDivClk0   = 0x0,
                .enableCLK2x= DL_SYSCTL_SYSPLL_CLK2X_DISABLE,
                .enableCLK1 = DL_SYSCTL_SYSPLL_CLK1_ENABLE,
                .enableCLK0 = DL_SYSCTL_SYSPLL_CLK0_ENABLE,
                .sysPLLMCLK = DL_SYSCTL_SYSPLL_MCLK::DL_SYSCTL_SYSPLL_MCLK_CLK0,
                .sysPLLRef  = DL_SYSCTL_SYSPLL_REF::DL_SYSCTL_SYSPLL_REF_SYSOSC,
                .qDiv       = 0x9,
                .pDiv       = DL_SYSCTL_SYSPLL_PDIV::DL_SYSCTL_SYSPLL_PDIV_2,
                .inputFreq  = DL_SYSCTL_SYSPLL_INPUT_FREQ::DL_SYSCTL_SYSPLL_INPUT_FREQ_16_32_MHZ,
            };
        DL_SYSCTL_configSYSPLL(&pll_config);
        DL_SYSCTL_setULPCLKDivider(DL_SYSCTL_ULPCLK_DIV::DL_SYSCTL_ULPCLK_DIV_1);
        DL_SYSCTL_setMCLKDivider(DL_SYSCTL_MCLK_DIVIDER::DL_SYSCTL_MCLK_DIVIDER_DISABLE);
        DL_SYSCTL_enableMFCLK();
        DL_SYSCTL_switchMCLKfromSYSOSCtoHSCLK(DL_SYSCTL_HSCLK_SOURCE::DL_SYSCTL_HSCLK_SOURCE_SYSPLL);
    }

    // must be done after enabling PLL
//    DL_FlashCTL_executeClearStatus(); // ERRNO thing

    #ifdef PROJECT_ENABLE_UART0
    {
        using namespace UART;
        uart0.partialInit();
        DL_GPIO_initPeripheralOutputFunction(IOMUX_PINCM21, IOMUX_PINCM21_PF_UART0_TX); // PA10   //PA10:TX, PA11:RX for LP
        DL_GPIO_initPeripheralInputFunction(IOMUX_PINCM22, IOMUX_PINCM22_PF_UART0_RX); // PA11
        DL_UART_enable(uart0.reg);
    }
    #endif

    #ifdef PROJECT_ENABLE_UART2
    {
        using namespace UART;
        uart2.partialInit();
        DL_GPIO_initPeripheralOutputFunction(IOMUX_PINCM46, IOMUX_PINCM46_PF_UART2_TX); // PA21
        DL_GPIO_initPeripheralInputFunction(IOMUX_PINCM47, IOMUX_PINCM47_PF_UART2_RX); // PA22
        DL_UART_enable(uart2.reg);
    }
    #endif

    #ifdef PROJECT_ENABLE_I2C0
        // TODO: code to set this up. should look like I2C1's init code below
    #endif
    #ifdef PROJECT_ENABLE_I2C1
    {
        using namespace I2C;

        DL_I2C_enablePower(System::i2c1.reg);
        delay_cycles(POWER_STARTUP_DELAY);
        /* timeout calculation. TDS.20.2.3.6/1520. or see the DL comments in their api.
         * formula -> "X / (1 / <clk> * 520 * 1e6) + 1"
         *      X: max wait in uS
         */
        DL_I2C_setTimeoutACount(System::i2c1.reg, 60.0 * configCPU_CLOCK_HZ / 520.0e6 + 1);
        DL_I2C_enableTimeoutA(System::i2c1.reg); // SCL low timeout detection

        // PA15
        DL_GPIO_initPeripheralInputFunctionFeatures(
                IOMUX_PINCM37,
                IOMUX_PINCM37_PF_I2C1_SCL,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_HYSTERESIS::DL_GPIO_HYSTERESIS_DISABLE,
                DL_GPIO_WAKEUP::DL_GPIO_WAKEUP_DISABLE
            );
        // PA16
        DL_GPIO_initPeripheralInputFunctionFeatures(
                IOMUX_PINCM38,
                IOMUX_PINCM38_PF_I2C1_SDA,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_HYSTERESIS::DL_GPIO_HYSTERESIS_DISABLE,
                DL_GPIO_WAKEUP::DL_GPIO_WAKEUP_DISABLE
            );
        DL_GPIO_enableHiZ(IOMUX_PINCM37);
        DL_GPIO_enableHiZ(IOMUX_PINCM38);

        DL_I2C_ClockConfig clk_config = {
                 .clockSel      = DL_I2C_CLOCK::DL_I2C_CLOCK_BUSCLK,
                 .divideRatio   = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2
            };
        DL_I2C_setClockConfig(i2c1.reg, &clk_config);
        DL_I2C_enableAnalogGlitchFilter(i2c1.reg);
        DL_I2C_resetControllerTransfer(i2c1.reg);
        DL_I2C_setControllerAddressingMode(i2c1.reg, DL_I2C_CONTROLLER_ADDRESSING_MODE::DL_I2C_CONTROLLER_ADDRESSING_MODE_7_BIT);


