Gregification/BeeMS/CAN_ETH_TRX_MSPM0G/src/Core/system.cpp
    };
}

void System::SPI::SPI::transfer_blocking(void * tx, void * rx, buffersize_t len, System::GPIO::GPIO const * cs){
    transfer(tx,rx,len,cs);
    while(isBusy())
        vTaskDelay(0);
    if(cs){ // extra fast clear
        cs->clear();
    }
}

void System::SPI::SPI::transfer(void * tx, void * rx, buffersize_t len, System::GPIO::GPIO const * cs){
    while(isBusy()) {
        vTaskDelay(0);
    }

    _trxBuffer.tx = (uint8_t *) tx;
    _trxBuffer.rx = (uint8_t *) rx;
    _trxBuffer.len = len;
    _trxBuffer.cs = cs;
    _trxBuffer.tx_i = 0;

    if(_trxBuffer.cs)
        _trxBuffer.cs->set();

    if(_trxBuffer.rx)
        _trxBuffer.rx_i = 0;
    else
        _trxBuffer.rx_i = _trxBuffer.tx_i;

    // start IRQ handlers
    reg->CPU_INT.ISET |= SPI_CPU_INT_ISET_TX_SET;
    NVIC_SetPendingIRQ(irq_type);
}

bool System::SPI::SPI::isBusy() {
    return      (_trxBuffer.tx && (_trxBuffer.tx_i < _trxBuffer.len))
            ||  (_trxBuffer.rx && (_trxBuffer.rx_i < _trxBuffer.len))
            ||  DL_SPI_isBusy(reg);
}

void System::I2C::I2C::setSCLTarget(uint32_t target, uint32_t clk){
    DL_I2C_ClockConfig clk_config;
    DL_I2C_getClockConfig(reg, &clk_config);

    // if clk too slow
    if(target * 20 > clk){
        clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_1;
        DL_I2C_setClockConfig(reg, &clk_config);
    }

    uint32_t effective_clk;
    do {
        effective_clk = clk;
        switch(clk_config.divideRatio){
            default:
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_1: effective_clk /= 1; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2: effective_clk /= 2; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_3: effective_clk /= 3; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_4: effective_clk /= 4; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_5: effective_clk /= 5; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_6: effective_clk /= 6; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_7: effective_clk /= 7; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8: effective_clk /= 8; break;
        }

        // if clk too fast
        if((effective_clk / (target * 10) - 1) > BV(5) && (clk_config.divideRatio != DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8)) {

            // increase divider and see if that works
            switch(clk_config.divideRatio){
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_1: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_3; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_3: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_4; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_4: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_5; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_5: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_6; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_6: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_7; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_7: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8; break;
                default:
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8: break;
            }
            DL_I2C_setClockConfig(reg, &clk_config);
        } else
            break;

    }while (true);

    DL_I2C_setTimerPeriod(reg, effective_clk / (target * 10) - 1);
}

bool System::I2C::I2C::tx_blocking(uint8_t addr, void * data, buffersize_t size, TickType_t) {
    bool ret = true;
    /*
     * Fill FIFO with data. This example will send a MAX of 8 bytes since it
     * doesn't handle the case where FIFO is full
     */
    DL_I2C_fillControllerTXFIFO(reg, (uint8_t *)data, size);

    /* Wait for I2C to be Idle */
    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
        vTaskDelay(0);

    /* Send the packet to the controller.
     * This function will send Start + Stop automatically.
     */
    DL_I2C_startControllerTransfer(reg, addr,
        DL_I2C_CONTROLLER_DIRECTION_TX, size);

    /* Poll until the Controller writes all bytes */
    while (DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_BUSY_BUS)
        vTaskDelay(0);

    /* Trap if there was an error */
    if (DL_I2C_getControllerStatus(reg) &
        DL_I2C_CONTROLLER_STATUS_ERROR) {
        ret = false;
    }

    /* Wait for I2C to be Idle */
    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
        vTaskDelay(0);

    /* Add delay between transfers */
    delay_cycles(1000);

    return ret;
}

bool System::I2C::I2C::rx_blocking(uint8_t addr, void * data, buffersize_t size, TickType_t) {
    /* Send a read request to Target */
    DL_I2C_startControllerTransfer(reg, addr,
        DL_I2C_CONTROLLER_DIRECTION_RX, size);

    /*
     * Receive all bytes from target. LED will remain high if not all bytes
     * are received
     */
    for (uint8_t i = 0; i < size; i++) {
        while (DL_I2C_isControllerRXFIFOEmpty(reg))
            vTaskDelay(0);
        ((uint8_t *)data)[i] = DL_I2C_receiveControllerData(reg);
    }

    return true;
}

void System::CANFD::CANFD::emptyRXFIFO(DL_MCAN_RX_FIFO_NUM fifonum) {
    DL_MCAN_RxFIFOStatus rf;
    rf.num = fifonum;

    while(true) {
        DL_MCAN_getRxFIFOStatus(reg, &rf);
        if(rf.fillLvl == 0)
            break;
        DL_MCAN_writeRxFIFOAck(reg, rf.num, rf.getIdx);
    }

}

const uint32_t System::CANFD::getCANID(DL_MCAN_RxBufElement const * b) {
    if(b->xtd)  return b->id;
    else        return (b->id & 0x1FFC'0000) >> 18;
}

const uint32_t System::CANFD::getCANID(DL_MCAN_TxBufElement const * b) {
    if(b->xtd)  return b->id;
    else        return (b->id & 0x1FFC'0000) >> 18;
}

uint8_t System::CANFD::DLC2Len(DL_MCAN_RxBufElement const * ele) {
    if(ele->dlc < 9)
        return ele->dlc;

    if(ele->fdf)
        switch(ele->dlc) {
            case 9:     return 12;
            case 10:    return 16;
            case 11:    return 20;
            case 12:    return 24;
            case 13:    return 32;
            case 14:    return 48;
            case 15:    return 64;
            default:    return 0;
        }
    else
        return 8;
}

